; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_6 ?v5 ?v1)
             (pred_12 ?v11 ?v9)
             (pred_9 ?v5 ?v9)
             (pred_5 ?v13 ?v5 )
	     (pred_11 ?v5)
             (pred_1 ?v2)
             (pred_3 ?v11)
             (pred_10 ?v9)
             (pred_7 ?v5)
             (pred_4 ?v11)
             (pred_2 ?v5)
             (pred_8 ))



(:action op_5
:parameters (?v12 ?v10 ?v3 ?v4)
:precondition (and (pred_1 ?v12) (pred_1 ?v10) (pred_3 ?v3) (pred_10 ?v4)
          (pred_6 ?v12 ?v10) (pred_12 ?v3 ?v4)
                   (pred_9 ?v10 ?v4) (pred_11 ?v12) 
                   (pred_7 ?v10) (pred_4 ?v3))
:effect (and  (pred_2 ?v10) (not (pred_7 ?v10))))


(:action op_2
:parameters (?v12 ?v8)
:precondition (and (pred_1 ?v12) (pred_1 ?v8)
               (pred_11 ?v12) (pred_6 ?v12 ?v8) (pred_2 ?v8))
:effect (and (pred_11 ?v8) (not (pred_11 ?v12))))

(:action op_1
:parameters (?v12 ?v3)
:precondition (and (pred_1 ?v12) (pred_3 ?v3) 
                  (pred_11 ?v12) (pred_5 ?v3 ?v12) (pred_8 ))
:effect (and (pred_4 ?v3)
   (not (pred_5 ?v3 ?v12)) (not (pred_8 ))))


(:action op_4
:parameters (?v12 ?v7 ?v6)
:precondition (and (pred_1 ?v12) (pred_3 ?v7) (pred_3 ?v6)
                  (pred_11 ?v12) (pred_4 ?v6) (pred_5 ?v7 ?v12))
:effect (and (pred_4 ?v7) (pred_5 ?v6 ?v12)
        (not (pred_4 ?v6)) (not (pred_5 ?v7 ?v12))))

(:action op_3
:parameters (?v12 ?v3)
:precondition (and (pred_1 ?v12) (pred_3 ?v3) 
                  (pred_11 ?v12) (pred_4 ?v3))
:effect (and (pred_8 ) (pred_5 ?v3 ?v12) (not (pred_4 ?v3)))))

; problem
(define (problem grid-4-4-2-2-2)
    (:domain grid)
    (:objects
    obj_19 obj_09 obj_15 obj_06 obj_12 obj_20 obj_13 obj_17 obj_11 obj_07 obj_14 obj_08 obj_16 obj_10 obj_03 obj_04
    obj_18 obj_05
    obj_01 obj_02
    )

    (:init
       (pred_8)

       (pred_1 obj_19)
       (pred_1 obj_09)
       (pred_1 obj_15)
       (pred_1 obj_06)
       (pred_1 obj_12)
       (pred_1 obj_20)
       (pred_1 obj_13)
       (pred_1 obj_17)
       (pred_1 obj_11)
       (pred_1 obj_07)
       (pred_1 obj_14)
       (pred_1 obj_08)
       (pred_1 obj_16)
       (pred_1 obj_10)
       (pred_1 obj_03)
       (pred_1 obj_04)
       (pred_10 obj_18)
       (pred_10 obj_05)
       (pred_3 obj_01)
       (pred_3 obj_02)

       (pred_6 obj_19 obj_12)
       (pred_6 obj_19 obj_09)
       (pred_6 obj_09 obj_20)
       (pred_6 obj_09 obj_15)
       (pred_6 obj_09 obj_19)
       (pred_6 obj_15 obj_13)
       (pred_6 obj_15 obj_06)
       (pred_6 obj_15 obj_09)
       (pred_6 obj_06 obj_17)
       (pred_6 obj_06 obj_15)
       (pred_6 obj_12 obj_11)
       (pred_6 obj_12 obj_20)
       (pred_6 obj_12 obj_19)
       (pred_6 obj_20 obj_07)
       (pred_6 obj_20 obj_13)
       (pred_6 obj_20 obj_09)
       (pred_6 obj_20 obj_12)
       (pred_6 obj_13 obj_14)
       (pred_6 obj_13 obj_17)
       (pred_6 obj_13 obj_15)
       (pred_6 obj_13 obj_20)
       (pred_6 obj_17 obj_08)
       (pred_6 obj_17 obj_06)
       (pred_6 obj_17 obj_13)
       (pred_6 obj_11 obj_16)
       (pred_6 obj_11 obj_07)
       (pred_6 obj_11 obj_12)
       (pred_6 obj_07 obj_10)
       (pred_6 obj_07 obj_14)
       (pred_6 obj_07 obj_20)
       (pred_6 obj_07 obj_11)
       (pred_6 obj_14 obj_03)
       (pred_6 obj_14 obj_08)
       (pred_6 obj_14 obj_13)
       (pred_6 obj_14 obj_07)
       (pred_6 obj_08 obj_04)
       (pred_6 obj_08 obj_17)
       (pred_6 obj_08 obj_14)
       (pred_6 obj_16 obj_10)
       (pred_6 obj_16 obj_11)
       (pred_6 obj_10 obj_03)
       (pred_6 obj_10 obj_07)
       (pred_6 obj_10 obj_16)
       (pred_6 obj_03 obj_04)
       (pred_6 obj_03 obj_14)
       (pred_6 obj_03 obj_10)
       (pred_6 obj_04 obj_08)
       (pred_6 obj_04 obj_03)
       (pred_7 obj_06)
       (pred_7 obj_16)
       (pred_9  obj_06 obj_18)
       (pred_9  obj_16 obj_05)
       (pred_2 obj_19)
       (pred_2 obj_09)
       (pred_2 obj_15)
       (pred_2 obj_12)
       (pred_2 obj_20)
       (pred_2 obj_13)
       (pred_2 obj_17)
       (pred_2 obj_11)
       (pred_2 obj_07)
       (pred_2 obj_14)
       (pred_2 obj_08)
       (pred_2 obj_10)
       (pred_2 obj_03)
       (pred_2 obj_04)

       (pred_12  obj_01 obj_18)
       (pred_12  obj_02 obj_05)
       (pred_5 obj_01 obj_20)
       (pred_5 obj_02 obj_07)
       (pred_11 obj_10)
    )

    (:goal (and
       (pred_5 obj_02 obj_16)
    ))
(:constraints
  (always (not (pred_11 obj_11)))
)
)

; plan
1. (op_2 obj_10 obj_07)
   deleted: (pred_11 obj_10)
   added: (pred_11 obj_07)
   goals met: 0 of 1
2. (op_1 obj_07 obj_02)
   deleted: (pred_5 obj_02 obj_07) (pred_8)
   added: (pred_4 obj_02)
   goals met: 0 of 1
3. (op_2 obj_07 obj_10)
   deleted: (pred_11 obj_07)
   added: (pred_11 obj_10)
   goals met: 0 of 1
4. (op_5 obj_10 obj_16 obj_02 obj_05)
   deleted: (pred_7 obj_16)
   added: (pred_2 obj_16)
   goals met: 0 of 1
5. (op_2 obj_10 obj_16)
   deleted: (pred_11 obj_10)
   added: (pred_11 obj_16)
   goals met: 0 of 1
6. (op_3 obj_16 obj_02)
   deleted: (pred_4 obj_02)
   added: (pred_8) (pred_5 obj_02 obj_16)
   goals met: 1 of 1
